# напишите программу которая позаданному номеру четверти показывает диапозон 
# возможных координат точек в этой четверти.
n = int(input())
if n == 1:
    print('x > 0 and y > 0')
elif n == 2:
    print('x < 0 and y > 0')
elif n == 3:
    print('x < 0 and yn< 0')
elif n == 4:
    print('x > 0 and y < 0')       
         